客源 = {
    "陈总": {"电话": 13333333333, "预算": 50, "需求": "投资公寓", "面积": 100},
    "熊总": {"电话": 19222222222, "预算": 30, "需求": "投资公寓", "面积": 100},
    "张总": {"电话": 13144444444, "预算": 20, "需求": "投资公寓", "面积": 36},
}
     #添加新客户
客源["凡姐"]={"电话": 13097213852, "预算": 19, "需求": "投资公寓", "面积": 39}
    #修改陈总想考虑200平豪宅
客源["陈总"]["面积"] = 200
客源["陈总"]["需求"] = "200平豪宅"
客源["陈总"]["预算"] = 200  
    #删除熊总,熊总已成交
del 客源["熊总"]
    #查询张总
print(客源["张总"])
    #遍历所以客户
for 姓名,信息 in 客源.items():
   print(f"{姓名}:电话{信息['电话']},预算{信息['预算']},需求{信息['需求']},面积{信息['面积']}")


  